Repository: 84000/data-translation-memory
Catalog: toh505-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པ་བཻ་ཌཱུརྱའི་འོད་ཅེས་བྱ་བའི་གཟུངས།
en: The Noble Vaiḍūryaprabha Dhāraṇī That Activates the Power of the Thus-Gone Ones’ Absorption

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་སྨན་གྱི་གནས་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was present in a medicine hall with a large saṅgha of monks and a large saṅgha of bodhisattvas.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་བསྐུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: At that time, the Blessed One entered the absorption called invitation to the buddha field.

source: དེ་མ་ཐག་ཏུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རབ་ཏུ་གཡོས་སོ། །ལྷའི་ཙནྡན་གྱི་ཕྱེ་མ་དང་། མེ་ཏོག་གི་ཆར་དཔག་ཏུ་མེད་པ་བབ་བོ། །
en: As soon as he did this, the entire trichiliocosm shook and an immeasurable rain of divine sandalwood powder and flowers fell from the sky.

source: དེ་བཞིན་གཤེགས་པ་བདུན་པོ་འཁོར་དང་བཅས་པ་འཇིག་རྟེན་གྱི་ཁམས་འདིར་གཤེགས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་ལས་བྱུང་བའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ནི་བསྐོར། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: The Seven Thus-Gone Ones and their retinues arrived in this world system and sat on lion thrones that had sprung up due to their previous roots of virtue.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་གྱུར་ཏོ། །
en: They were surrounded by all manner of bodhisattvas as well as gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, kings, ministers, brahmins, and householders.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, through the Buddha’s power, Mañjuśrīkumārabhūta rose from his seat, placed his palms together, and addressed them, saying, “Thus-Gone Ones, please consider my request.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དགོངས་སུ་གསོལ། སེམས་ཅན་རྣམས་ཀྱི་སྡིག་པ་ཐམས་ཅད་སྦྱང་བ་དང་། ནད་ཐམས་ཅད་ཞི་བར་བགྱི་བ་དང་། རེ་བ་ཐམས་ཅད་བསྐང་དུ་གསོལ།
en: Please purify all beings’ misdeeds, cure all their illnesses, and fulfill all their hopes.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འདི་དག་གི་མཚན་དང་། སྔོན་གྱི་སྨོན་ལམ་གྱིས་བྱིན་གྱིས་བརླབས་པའི་གཟུངས་བཤད་དུ་གསོལ།
en: Please tell us the names of these blessed thus-gone ones and the dhāraṇī that has been blessed by their previous aspirations.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One expressed his approval of Mañjuśrīkumārabhūta, saying, “Good, Mañjuśrī, good.

source: ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་བཤད་དོ། །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས།
en: Listen well, focus your attention, and I will explain.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་ནོ་ཞེས་གསོལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Very well, Blessed One,” said Mañjuśrīkumārabhūta, who listened just as the Blessed One had said.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འདི་ལྟ་སྟེ། དེ་བཞིན་གཤེགས་པ་མཚན་ལེགས་པར་ཡོངས་བསྒྲགས་དཔལ་གྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: The Blessed One spoke the following words: “Homage to the thus-gone one Suparikīrtita­nāma­dheyaśrī­rāja.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་དང་ཟླ་བ་དང་པདྨས་རབ་ཏུ་བརྒྱན་པ་མཁས་པ་གཟི་བརྗིད་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one King Roaring Splendor of Mastery Who Is Adorned with Lotuses, the Moon, and Jewels.

source: དེ་བཞིན་གཤེགས་པ་གསེར་བཟངས་དྲི་མེད་རིན་ཆེན་སྣང་བརྟུལ་ཞུགས་གྲུབ་པའི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one King Resplendent Untarnished Jewel of Striking Color Who Has Perfect Conduct.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་མཆོག་དཔལ་གྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one Glorious King Supreme in His Lack of Sorrow.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one King Roaring Sea of Renown in the Dharma.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོ་མཆོག་གི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་མཁྱེན་པའི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one King of Supernatural Perception Who Revels in the Exalted Mind of the Sea of Dharma.

source: དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one Bhaiṣajya­guru­vaiḍūrya­prabha­rāja.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the thus-gone one Śākyamuni.

source: བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the blessed one Prajñāpāramitā.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Mañjuśrīkumārabhūta.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Avalokiteśvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Vajrapāṇi.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མ་ལྟར་རྣམ་པར་སྣང་བྱེད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Vairocana, who is like the sun.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟླ་བ་ལྟར་རབ་ཏུ་བསིལ་བྱེད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Cooling, who is like the moon.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Mahāmati.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Maitreya.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Vajra.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོབས་པ་བརྩེགས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Pratibhānakūṭa.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་གནོན་པ་དོན་ཡོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Unfailing Might.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བལྟ་ན་མཛེས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Priyadarśana.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མུན་པ་མུན་ནག་ཐམས་ཅད་ངེས་པར་འཇོམས་པའི་བློ་གྲོས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being He Whose Mind Dispels All Darkness.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་པ་ལེགས་པར་རྣམ་པར་སེམས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Sucintitacintin.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་བརྩེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Merukūṭa.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སང་སང་པོའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being Gadgadasvara.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལྷུན་པོ་ཆེན་པོའི་རྩེ་འཛིན་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the bodhisattva great being King Who Holds the Peak of Great Mount Meru.

source: འཕགས་པ་དགྲ་བཅོམ་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the noble, worthy Śāriputra and Mahāmaudgalyāyana.

source: ལྷའི་དགེ་བསྙེན་ཆེན་པོ་དཔལ་ཚངས་པ་དང་བརྒྱ་བྱིན་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the great divine lay practitioners, glorious Brahmā and Śakra.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the Four Great Kings.

source: ཀླུའི་དགེ་བསྙེན་ཆེན་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the great nāga lay practitioner Blessed Buddha.

source: གནོད་སྦྱིན་གྱི་དགེ་བསྙེན་ཆེན་པོ་བཅུ་གཉིས་ལ་ཕྱག་འཚལ་ལོ། །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་གསུང་དབྱངས་གཅིག་གིས་གཟུངས་ཀྱི་ཚིག་འདི་དག་བཀའ་སྩལ་ཏོ། །ན་མོ་རཏྣ་ཏྲ་ཡཱ་ཡ། ན་མོ་བྷ་ག་ཝ་ཏེ། ཨ་པྲ་ཏི་ཧ་ཏ། བྷཻ་ཥ་ཛྱེ་རཱ་ཛཱ་ཡ། ཏདྱ་ཐཱ། ཨོཾ་སརྦ་ཏ་ཐཱ་ག་ཏ་ཧཱུྃ། གྷུ་མེ་གྷུ་མེ། ཨི་མི་ནི་མི་ཧི། མ་ཏི་མ་ཏི། སཔྟ་ཏ་ཐཱ་ག་ཏ། ས་མཱ་དྷྱ་དྷིཥྛི་ཏེ། ཨ་ཏི་མ་ཏེ་པཱ་ལེ་པཱ་པཾ་ཤོ་དྷ་ནི། སརྦ་པཱ་པཾ་ནཱ་ཤ་ཡ། མ་མ་བུདྡྷེ། བུདྡྷོ་ཏྟ་མེ། ཨུ་མེ་ཀུ་མེ། བུད་དྷ་ཀྵེ་ཏྲ་པ་རི་ཤོ་དྷ་ནི། དྷ་མེ་ནི་དྷ་མེ། མེ་རུ་མེ་རུ། མེ་རུ་ཤི་ཁ་རེ། སརྦ་ཨ་ཀཱ་ལ་མྲྀ་ཏྱུ་ནི་བཱ་ར་ཎི། བུདྡྷེ་སུ་བུདྡྷེ། བུདྡྷ་ཨ་དྷིཥྛཱ་ན། ཨ་དྷིཥྛི་ཏེ་ན། རཀྵ་ནྟུ་མེ། སརྦ་དེ་བ་ས་མེ། ཨ་ས་མེ། ས་མ་ནྭཱ་ཧ་རནྟུ་མེ། སརྦ་བུད་དྷ། བོ་དྷི་སཏྭཱ། ཤ་མེ་ཤ་མེ། པྲ་ཤ་མནྟུ་མེ། སརྦེ་ཏྱུ་པ་དྲཱ་བ། བྱཱ་དྷ་ཡཿ། པུ་ར་ཎི། སུ་པཱུར་ཎི། པཱུ་ར་ཡ་མེ། སརྦ་ཨཱ་ཤཱ་མེ།
en: “Homage to the twelve great yakṣa generals.”

source: བཻ་ཌཱུརྱ་པྲ་ཏི་བྷཱ་སེ། སརྦ་པཱ་པཾ་ཀྵ་ཡཾ་ཀ་རི་སྭཱ་ཧཱ། ཨོཾ་བྷཻ་ཥ་ཛྱེ་བྷཻ་ཥ་ཛྱེ། མ་ཧཱ་བྷཻ་ཥ་ཛྱེ། ས་མུཏྒ་ཏེ་སྭཱ་ཧཱ། དེ་བཞིན་གཤེགས་པའི་མཚན་དང་གཟུངས་འདི་བཀའ་སྩལ་པའི་ཚེ་སྣང་བ་ཆེན་པོ་བྱུང་སྟེ། ས་ཆེན་པོ་ཡང་གཡོས་ནས་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་དག་སྣང་ངོ་། །
en: All the thus-gone ones then spoke the words of the dhāraṇī in a single melodious voice: namo ratnatrayāya | namo bhagavate apratihata­bhaiṣajyarājāya | tadyathā | oṁ sarva­tathāgata hūṁ ghume ghume imini mihi mati mati saptata­thāgata­samādhya­dhiṣṭhite atimate pāle pāpaṃ śodhani sarva­pāpaṃ nāśaya mama buddhe buddhottame ume kume buddha­kṣetra­pariśodhani dhameni dhame meru meru meru­śikhare sarvākālam­ṛtyuni­vāraṇi buddhe subuddhe buddhā­dhiṣṭhānā­dhiṣṭhitena rakṣantu me sarva­deva same asame saman­vāharantu me sarva­buddha­bodhi­sattvā śame śame pra­śamantu me sarvetyupa­drāvavyā­dhayaḥ pūrāṇī supūrāṇī pūraya me sarvāśāme vaiḍūrya­pratibhāse sarva­pāpaṃ kṣayaṅkari svāhā | oṁ bhaṣajye bhaiṣajye mahā­bhaiṣajye sam­udgate svāhā As the names of the thus-gone ones and this dhāraṇī were pronounced, a great light shone, the vast earth shook, and miraculous emanations appeared.

source: འཁོར་ཇི་ལྟར་ལྷགས་པ་དེ་དག་གིས་ཀྱང་སྤོས་དང་བདུག་པ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མཆོད་ནས་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ། ལན་བདུན་དུ་བསྐོར་བ་བྱས་སོ། །
en: The assemblies gathered there made offerings of perfume and incense to the thus-gone ones, expressed their approval, and circumambulated them seven times.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བདུན་པོ་དེ་དག་མི་སྣང་བར་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Seven Thus-Gone Ones then disappeared.

source: རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པའི་མཚན་དང་གཟུངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། མཆོད་པ་དེས་གཙང་མར་བྱས་ཏེ།
en: Blessed Śākyamuni then spoke: “Any son or daughter of good family who upholds, carries, recites, and makes offerings to this dhāraṇī and the names of the thus-gone ones will be cleansed.

source: ཕྱོགས་གཙང་མར་འཕགས་པའི་ཡན་ལག་བརྒྱད་དང་ལྡན་པར་བྱས་ལ།
en: They will cleanse the directions and maintain the eightfold noble path.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་བས་ས་ག་ལ་བབ་པའི་ཉ་ནས་བརྩམས་ཏེ་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྐུ་གཟུགས་བྱས་ལ་ཚེས་བརྒྱད་དང་བཅུ་བཞི་དང་བཅྭ་ལྔ་ལ་སྨྱུང་བར་གནས་པས་གཟུངས་འདི་དག་བཞི་བཅུ་རྩ་དགུའམ།
en: “With supreme compassion for all beings, they should begin on the full moon during Viśākhā.

source: སྟོང་རྩ་བརྒྱད་དམ། སྟོང་ཕྲག་བཞི་བཅུ་རྩ་དགུ་འདོན་ཅིང་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མར་མེ་དང་། ཕྲེང་བ་དང་། རོལ་མོའི་སྒྲ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཀྱིས་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་མཆོད་པ་བྱེད་ན།
en: They should make an image of the thus-gone ones, fast on the eighth, fourteenth, and fifteenth days, and then recite the dhāraṇī forty-nine, one thousand and eight, or forty-nine thousand times while offering flowers, incense, perfume, lamps, garlands, music, parasols, banners, and flags three times per day and three times per night.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་དགོངས་པར་འགྱུར། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་སེམས་པར་འགྱུར།
en: “When they do, the thus-gone ones will direct their attention toward them and all the bodhisattvas will think of them.

source: ཚངས་པ་དང་། བརྒྱ་བྱིན་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ཀླུའི་དགེ་བསྙེན་ཆེན་པོ་དག་གིས་ཀྱང་ཡོངས་སུ་སྐྱོང་བར་འགྱུར། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་རྡོ་རྗེ་འཛིན་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྲུང་བར་འགྱུར།
en: Brahmā, Śakra, the Four Great Kings, and the great nāga lay practitioners will protect them, and they will be guarded by all the vajra-wielding yakṣa generals.

source: མཚམས་མེད་པ་ལྔ་ལ་སོགས་པའི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བྱང་བར་འགྱུར།
en: All of their karmic obscurations will be purified, including the five acts with immediate retribution and so forth.

source: ནད་ཐམས་ཅད་ཀྱིས་མི་བཏབ་པར་འགྱུར། རིང་དུ་འཚོ་བར་འགྱུར། དུས་མ་ཡིན་པར་འཆི་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར། འཆི་བ་དང་།
en: They will not contract any illnesses, will have a long life, and will avoid any kind of unnatural death.

source: དགྲ་དང་། དགོན་པའི་གནོད་པ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར།
en: Death, enemies, dangers of the wilderness, conflict, arguments, and disputes will all be pacified.

source: དགྲ་ཐམས་ཅད་ཀྱི་དབང་དུ་མི་འགྲོ་བར་འགྱུར། ཅི་བསམས་པའི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: They will not be enthralled by any enemy, and anything they wish for will be fulfilled.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: At that point Mañjuśrīkumārabhūta addressed the Blessed One, saying, “Blessed One, what is the name of this Dharma discourse?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How should it be remembered?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་གཟུངས་ཞེས་བྱ་བར་ཟུང་ཤིག །
en: “Mañjuśrī,” the Blessed One replied, “this Dharma discourse should be known as The Dhāraṇī of Vaiḍūryaprabha That Activates the Power of the Thus-Gone Ones’ Absorption.

source: ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འཐག་ཅིང་སྦྱོང་བ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: It should be known as Pulverizing and Purifying all Karmic Obscurations.

source: དེ་བཞིན་གཤེགས་པ་བདུན་གྱི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །
en: It should be known as Displaying the Emanations of the Seven Thus-Gone Ones.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: When the Blessed One said this, Mañjuśrīkumārabhūta and the entire assembly rejoiced and praised the words of the Blessed One.

source: འཕགས་པ་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་བསྐྱེད་པ་བཻ་ཌཱུརྱའི་འོད་ཅེས་བྱ་བའི་གཟུངས་རྫོགས་སོ།། །།
en: This concludes “The Noble Dhāraṇī of Vaiḍūryaprabha That Activates the Power of the Thus-Gone Ones’ Absorption.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཤཱི་ལེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།སླད་ཀྱིས་རྒྱ་གར་གྱི་མཁན་པོ་དཱི་བཾ་ཀ་ར་ཤྲི་ཛྙཱ་ན་དང་། དགེ་སློང་ཚུལ་ཁྲིམས་རྒྱལ་བས་ཐོ་ལིང་གསེར་ཁང་དུ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།​།
en: This was translated, edited, and finalized by the Indian preceptors Jinamitra, Dānaśīla, and Śīlendrabodhi along with the great editor and translator Bandé Yeshé Dé. It was later updated and finalized according to the new translation guidelines by the Indian preceptor Dīpaṅkaraśrījñāna and the monk Tsültrim Gyalwa at Tholing Serkang.
